tex/vinaya-class-questions/pali-cheatsheet.tex
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{memoir}
\input{./vocabulary-preamble.tex}
\setcounter{secnumdepth}{2}
\date{\today}
\title{Pāli Cheatsheet}
\hypersetup{
 pdfauthor={The Bhikkhu Saṅgha},
 pdftitle={Pāli Cheatsheet},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}


\chapter{Pāli Cheatsheet}
\label{sec:org7171f56}
\section{Masculine and Neuter Nouns Ending in -a}
\label{sec:org83b50ae}

\begin{center}
\begin{tabular}{lllll}
 & \textbf{masc.sg.-a} & \textbf{nt.sg.-a} & \textbf{masc.pl.-a} & \textbf{nt.pl.-a}\\[0pt]
\hline
1. nom & nar\textbf{o} & citt\textbf{aṁ} & nar\textbf{ā} & citt\textbf{ā}, citt\textbf{āni}\\[0pt]
2. acc & nar\textbf{aṁ} & citt\textbf{aṁ} & nar\textbf{e} & citt\textbf{e}, citt\textbf{āni}\\[0pt]
3. inst & nar\textbf{ena} & citt\textbf{ena} & nar\textbf{ehi} & citt\textbf{ehi}\\[0pt]
4. dat & nar\textbf{āya}, nar\textbf{assa} & citt\textbf{āya}, citt\textbf{assa} & nar\textbf{ānaṁ} & citt\textbf{ānaṁ}\\[0pt]
5. abl & nar\textbf{ā}, nar\textbf{amhā}, nar\textbf{asmā} & citt\textbf{ā}, citt\textbf{amhā}, citt\textbf{asmā} & nar\textbf{ehi} & citt\textbf{ehi}\\[0pt]
6. gen & nar\textbf{assa} & citt\textbf{assa} & nar\textbf{ānaṁ} & citt\textbf{ānaṁ}\\[0pt]
7. loc & nar\textbf{e} nar\textbf{amhi} nar\textbf{asmiṁ} & citt\textbf{e} citt\textbf{amhi} citt\textbf{asmiṁ} & nar\textbf{esu} & citt\textbf{esu}\\[0pt]
8. voc & nar\textbf{a}, nar\textbf{ā} & citt\textbf{a} citt\textbf{ā} & nar\textbf{ā} & citt\textbf{āni}\\[0pt]
\end{tabular}
\end{center}

\section{Masculine and Neuter Nouns Ending in -u}
\label{sec:org7bdfa95}

\begin{center}
\begin{tabular}{lllll}
 & \textbf{masc.sg.} & \textbf{nt.sg.} & \textbf{masc.pl.} & \textbf{nt.pl.}\\[0pt]
\hline
1. nom & bhikkh\textbf{u} & āy\textbf{uṁ} & bhikkh\textbf{ū}, bhikkh\textbf{avo} & āy\textbf{ū}, āy\textbf{ūni}\\[0pt]
2. acc & bhikkh\textbf{uṁ} & āy\textbf{uṁ} & bhikkh\textbf{ū}, bhikkh\textbf{avo} & āy\textbf{ū}, āy\textbf{ūni}\\[0pt]
3. inst & bhikkh\textbf{unā} & āy\textbf{unā} & bhikkh\textbf{ūhi} & āy\textbf{ūhi}\\[0pt]
4. dat & bhikkh\textbf{uno}, bhikkh\textbf{ussa} & āy\textbf{uno}, āy\textbf{ussa} & bhikkh\textbf{ūnaṁ} & āy\textbf{ūnaṁ}\\[0pt]
5. abl & bhikkh\textbf{unā}, bhikkh\textbf{umhā}, & āy\textbf{unā}, āy\textbf{umhā}, & bhikkh\textbf{ūhi} & āy\textbf{ūhi}\\[0pt]
 & bhikkh\textbf{usmā} & āy\textbf{usmā} &  & \\[0pt]
6. gen & bhikkh\textbf{uno}, bhikkh\textbf{ussa} & āy\textbf{uno}, āy\textbf{ussa} & bhikkh\textbf{ūnaṁ} & āy\textbf{ūnaṁ}\\[0pt]
7. loc & bhikkh\textbf{umhi} bhikkh\textbf{usmiṁ} & āy\textbf{umhi} āy\textbf{usmiṁ} & bhikkh\textbf{ūsu} & āy\textbf{ūsu}\\[0pt]
8. voc & bhikkh\textbf{u} & āy\textbf{u} & bhikkh\textbf{ū}, bhikkh\textbf{avo}, & āy\textbf{ū}, āy\textbf{ūni}\\[0pt]
 &  &  & bhikkh\textbf{ave} & \\[0pt]
\end{tabular}
\end{center}

\section{Feminine Nouns Ending in -ā and -i}
\label{sec:org415f794}

\begin{center}
\begin{tabular}{lllll}
 & \textbf{fem.sg.-ā} & \textbf{fem.sg.-i} & \textbf{fem.pl.-ā} & \textbf{fem.pl.-i}\\[0pt]
\hline
1. nom & vedan\textbf{ā} & bhūm\textbf{i} & vedan\textbf{ā}, vedan\textbf{āyo} & bhūm\textbf{ī}, bhūm\textbf{iyo}\\[0pt]
2. acc & vedan\textbf{aṁ} & bhūm\textbf{iṁ} & vedan\textbf{ā}, vedan\textbf{āyo} & bhūm\textbf{ī}, bhūm\textbf{iyo}\\[0pt]
3. inst & vedan\textbf{āya} & bhūm\textbf{iyā} & vedan\textbf{āhi} & bhūm\textbf{īhi}\\[0pt]
4. dat & vedan\textbf{āya} & bhūm\textbf{iyā} & vedan\textbf{ānaṁ} & bhūm\textbf{īnaṁ}\\[0pt]
5. abl & vedan\textbf{āya} & bhūm\textbf{iyā} & vedan\textbf{āhi} & bhūm\textbf{īhi}\\[0pt]
6. gen & vedan\textbf{āya} & bhūm\textbf{iyā} & vedan\textbf{ānaṁ} & bhūm\textbf{īnaṁ}\\[0pt]
7. loc & vedan\textbf{āya}, vedan\textbf{āyaṁ} & bhūm\textbf{iyā}, bhūm\textbf{iyaṁ} & vedan\textbf{āsu} & bhūm\textbf{isu}, bhūm\textbf{īsu}\\[0pt]
8. voc & vedan\textbf{e} & bhūm\textbf{i} & vedan\textbf{ā}, vedan\textbf{āyo} & bhūm\textbf{ī}, bhūm\textbf{iyo}\\[0pt]
\end{tabular}
\end{center}

\clearpage

\section{Simple Present}
\label{sec:orgf67452c}

{\centering\par
\begin{multicols}{2}

Verbal terminations:

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\textbf{1st} & -mi & -ma\\[0pt]
\textbf{2nd} & -si & -tha\\[0pt]
\textbf{3rd} & -ti & -(a)nti\\[0pt]
\end{tabular}
\end{center}

The base is obtained by removing the 3rd.sg. termination \emph{-ti} from the conjugated form.

\columnbreak

Root: \emph{√dhāv} (to run), base: \emph{dhāva}

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\textbf{1st} & dhāvāmi & dhāvāma\\[0pt]
\textbf{2nd} & dhāvasi & dhāvatha\\[0pt]
\textbf{3rd} & dhāvati & dhāvanti\\[0pt]
\end{tabular}
\end{center}

The final \emph{-a} of the base is lengthened before \emph{m}: \emph{dhāvāmi, dhāvāma}.

\end{multicols}
\par}

\section{Future Tense}
\label{sec:org43f6b0a}

The verb \emph{atthi} (he is) is not used in the future tense, \emph{bhavissati} is used instead.

\begin{center}
\begin{tabular}{llll}
\textbf{sg.} &  & \textbf{pl.} & \\[0pt]
bhav\textbf{issāmi} & I will be & bhav\textbf{issāma} & we will be\\[0pt]
bhav\textbf{issasi} & you will be & bhav\textbf{issatha} & you all will be\\[0pt]
bhav\textbf{issati} & he will be & bhav\textbf{issanti} & they will be\\[0pt]
\end{tabular}
\end{center}

\section{Aorist Past Tense}
\label{sec:orgbe4d456}

{\centering\par
\begin{multicols}{2}

Verbal terminations:

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\textbf{1st} & -iṁ & -(i)mhā, -(i)mha\\[0pt]
\textbf{2nd} & -o, -i & -(i)ttha\\[0pt]
\textbf{3rd} & -i & -(i)ṁsu, -uṁ\\[0pt]
\end{tabular}
\end{center}

\columnbreak

Root: \emph{√dhāv} (to run), base: \emph{dhāva}

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\textbf{1st} & adhāviṁ & adhāvimhā\\[0pt]
\textbf{2nd} & adhāvo, adhāvi & adhāvittha\\[0pt]
\textbf{3rd} & adhāvi & adhāviṁsu, adhāvuṁ\\[0pt]
\end{tabular}
\end{center}

\end{multicols}
\par}

Bases ending in \textbf{e} are conjugated with an inserted ``s''.

\begin{center}
\begin{tabular}{lllll}
 & singular &  & plural & \\[0pt]
\hline
3rd & dese\textbf{si} & he taught & dese\textbf{suṁ} & they taught\\[0pt]
2nd & dese\textbf{si} & you taught & des\textbf{ittha} & you all taught\\[0pt]
1st & dese\textbf{siṁ} & I taught & des\textbf{imha} & we taught\\[0pt]
 &  &  & des\textbf{imhā} & \\[0pt]
\end{tabular}
\end{center}

Also applies to causative verbs (e.g. \emph{vandati} → \emph{vandāpeti} → \emph{vandāpesi}).

Similarly \emph{samacintesi, āmantesi, santappesi, samuttejesi} etc.

Some roots ending in long vowels also get the \emph{s} aorist ending. In the plural case, the long vowel is shortened.

\begin{center}
\begin{tabular}{lllll}
 & \textbf{sg.} &  & \textbf{pl.} & \\[0pt]
\hline
1st & aṭṭhā\textbf{siṁ} & I stood & aṭṭha\textbf{mha}, aṭṭha\textbf{mhā} & we stood\\[0pt]
2nd & aṭṭhā\textbf{si} & you stood & aṭṭha\textbf{ttha} & you all stood\\[0pt]
3rd & aṭṭhā\textbf{si} & he stood & aṭṭha\textbf{ṁsu} & they stood\\[0pt]
\end{tabular}
\end{center}

\clearpage

\section{Pronouns}
\label{sec:orgae32759}

{\centering\par
\begin{multicols}{2}

Personal pronouns (nominative)

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\textbf{1st} & ahaṁ & amhe, mayaṁ, no\\[0pt]
\textbf{2nd} & tuvaṁ, tvaṁ & tumhe, vo\\[0pt]
\textbf{3rd.masc.} & so, sa & te\\[0pt]
\textbf{3rd.nt.} & taṁ, tad & tāni\\[0pt]
\textbf{3rd.fem.} & sā & tā, tāyo\\[0pt]
\end{tabular}
\end{center}

\columnbreak

Possessive pronouns (genitive)

\begin{center}
\begin{tabular}{ll}
\textbf{sg.} & \textbf{pl.}\\[0pt]
mama, mayhaṁ, me & amhākaṁ, no\\[0pt]
tava, tuyhaṁ, te & tumhākam\\[0pt]
tassa & tesaṁ\\[0pt]
tassa & tesaṁ\\[0pt]
tassā & tāsaṁ\\[0pt]
\end{tabular}
\end{center}

\end{multicols}
\par}

\begin{center}
\begin{tabular}{lll}
ta → & \emph{(nom.sg.)} so / taṁ / sā & \emph{(nom.pl.)} te / tāni / tā, tāyo\\[0pt]
 & \emph{(acc.sg.)} taṁ & \emph{(acc.pl.)}  te / tāni / tā, tāyo\\[0pt]
\end{tabular}
\end{center}

\section{Interrogatives and Other Indeclinables}
\label{sec:org62ee2f9}

\begin{multicols}{2}

\begin{center}
\begin{tabular}{L{0.48\linewidth} L{0.48\linewidth}}
and what? but why? etc & kiñca [kiṁ + ca]\\[0pt]
have? did? & api\\[0pt]
how far? how much? & kīva\\[0pt]
how? in what way? & kinti\\[0pt]
how? & kathaṁ\\[0pt]
what? which? & katama\\[0pt]
when? & kadā\\[0pt]
where? from where? & kuto [ka + to]\\[0pt]
where? & kahaṁ\\[0pt]
where? & kattha\\[0pt]
where? & kuhiṁ\\[0pt]
where? & kuvaṁ\\[0pt]
who? what? how? would? & api nu\\[0pt]
who? what? which? why? & kiṁ\\[0pt]
why? lit. from what? & kasmā [ka + smā]\\[0pt]
afterwards; later & pacchā\\[0pt]
always & sabbadā\\[0pt]
at most; for a maximum of & paramaṁ\\[0pt]
before; earlier & pure\\[0pt]
before, previously & pubbe\\[0pt]
beyond; across; over & pāraṁ\\[0pt]
both & ubho\\[0pt]
brother(s); friend(s) & āvuso\\[0pt]
but; rather; even & atha\\[0pt]
\end{tabular}
\end{center}

\columnbreak

\begin{center}
\begin{tabular}{L{0.48\linewidth} L{0.48\linewidth}}
certainly; definitely & ekaṁsena\\[0pt]
ever; sometime & kadāci\\[0pt]
for a week; for seven days & sattāhaṁ\\[0pt]
from there & tato\\[0pt]
here; now; in this case & idha\\[0pt]
if & sace\\[0pt]
if; whether; perhaps & yadi\\[0pt]
I hope; I trust & kacci\\[0pt]
immediately after that & anantaraṁ\\[0pt]
in the presence (of); near (to) & santike\\[0pt]
like; as; according to; how & yathā\\[0pt]
more; greater; superior & bhiyyo\\[0pt]
now & idāni\\[0pt]
personally; with one's hand & sahatthā\\[0pt]
privately; alone; secretly & raho\\[0pt]
silence, quiet & tuṇhī\\[0pt]
that much; still; at least & tāva\\[0pt]
there & tattha / tatra\\[0pt]
today & ajja\\[0pt]
together; accompanied by & saddhiṁ, saha\\[0pt]
tomorrow & suve\\[0pt]
when; whenever & yadā\\[0pt]
yesterday & hīyo\\[0pt]
\end{tabular}
\end{center}

\end{multicols}

\clearpage

\section{Irregular verb √as (to be)}
\label{sec:org1c7c4b4}

{\centering\par
\begin{multicols}{3}

Present Tense

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\hline
3rd & atthi & santi\\[0pt]
2nd & asi & attha\\[0pt]
1st & amhi & amha\\[0pt]
 & asmi & amhā\\[0pt]
 &  & asma\\[0pt]
\end{tabular}
\end{center}

\columnbreak

Imperative Mood

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\hline
3rd & atthu & santu\\[0pt]
2nd & āhi & attha\\[0pt]
1st & amhi & amha\\[0pt]
 & asmi & amhā\\[0pt]
 &  & asma\\[0pt]
\end{tabular}
\end{center}

\columnbreak

Aorist Past Tense

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\hline
3rd & ās\textbf{i} & ās\textbf{iṁsu}\\[0pt]
 &  & ās\textbf{uṁ}\\[0pt]
2nd & ās\textbf{i} & ās\textbf{ittha}\\[0pt]
1st & ās\textbf{iṁ} & ās\textbf{imha}\\[0pt]
 &  & ās\textbf{imhā}\\[0pt]
\end{tabular}
\end{center}

\end{multicols}
\par}

\section{Irregular verb √hū (to be)}
\label{sec:org9e5f91a}

{\centering\par
\begin{multicols}{3}

Present Tense

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\hline
3rd & hoti & honti\\[0pt]
2nd & hosi & hotha\\[0pt]
1st & homi & homa\\[0pt]
\end{tabular}
\end{center}

\columnbreak

Imperative Mood

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\hline
3rd & hotu & hontu\\[0pt]
2nd & hohi & hotha\\[0pt]
1st & homi & homa\\[0pt]
\end{tabular}
\end{center}

\columnbreak

Aorist Past Tense

\begin{center}
\begin{tabular}{lll}
 & \textbf{sg.} & \textbf{pl.}\\[0pt]
\hline
3rd & ahos\textbf{i} & ahes\textbf{uṁ}\\[0pt]
2nd & ahos\textbf{i} & ahuva\textbf{ttha}\\[0pt]
1st & ahos\textbf{iṁ} & ahu\textbf{mhā}\\[0pt]
 &  & ahu\textbf{mha}\\[0pt]
\end{tabular}
\end{center}

\end{multicols}
\par}
\end{document}